Repository: 84000/data-translation-memory
Catalog: toh1-1-v1.tmx
Source language: bo
Languages: en

source: ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོས་དེ་དག་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་ཅི་ཟེར།
en: The venerable Saṅgharakṣita said to them, “What are you talking about, gentlemen

source: དེ་དག་གིས་སྨྲས་པ། འཕགས་པ་རྒྱ་མཚོ་ཆེན་པོ་ནས་འཕགས་པ་དགེ་འདུན་འཚོ་ངེད་ལ་བྱིན་ཅིག་ཅེས་སྒྲ་བྱུང་ངོ་། །
en: “Noble one,” they replied, “a voice from the ocean has said, ‘Give us the noble Saṅgharakṣita!’

source: དེས་སྨྲས་པ། ཅིའི་ཕྱིར་མི་སྦྱིན།
en: “Why do you not give me over?”

source: དེ་དག་གིས་སྨྲས་པ། འཕགས་པ་ཁྱོད་ནི་བདག་ཅག་གི་ནེའུ་ལྡངས་ལྷན་ཅིག་སྐྱེས་པ་ས་རྡུལ་ལ་ལྷན་ཅིག་རྩེ་རྩེ་བ། །
en: “Noble one, you are our peer. We grew up together playing in the dirt with you.

source: བཅོམ་ལྡན་འདས་དང་། བཙུན་པ་ཤཱ་རིའི་བུས་བདག་ཅག་ལ་གནང་བ་ལགས་པ
en: The Blessed One and the venerable Śāriputra have entrusted you to us,

source: ས་བདག་ཅག་ཁྱོད་དང་ཐབས་ཅིག་འགུམ་པ་དང་དུས་བགྱིད་པ་ནི་བླའི། ཁྱོད་ཡོངས་སུ་གཏང་བར་ནི་མི་བགྱིའོ།
en: so we would sooner die and face our death with you than turn you over.”

source: ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོས་བསམས་པ།
en: The venerable Saṅgharakṣita thought,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་དགེ་འདུན་འཚོ་ཁྱོད་རྒྱ་མཚོ་ཆེན་པོར་འཇུག་ཏུ་སོང་ལ་ཁྱོད་ཀྱིས་འཇིགས་པ་དང་འཇིགས་སུ་རུང་བ་དག་བཟོད་པར་གྱིས་ཤིག་ཅེས་བཀའ་སྩལ་པ་གང་ཡིན་པ་དེ་ནི་འདི་ཡིན་ནོ་སྙམ་ནས།
en: “This must be what the Blessed One meant when he said to me, ‘Saṅgharakṣita, you shall go on this journey across the ocean and face your fears along with what provokes them.’

source: དེས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ་བདག་ཉིད་རྒྱ་མཚོ་ཆེན་པོར་མཆོང་བར་བརྩམས་པ་དང་། དེ་ནས་ཚོང་པ་དེ་དག་གིས་དེས་དེ་ལྟར་བརྩམས་པ་མཐོང་
en: Taking up his begging bowl and Dharma robe, he prepared to jump into the sea. Seeing him prepare to jump,

source: ནས་སྨྲས་པ། འཕགས་པ་དགེ་འདུན་འཚོ་ཅི་མཛད་ཅི་མཛད།
en: the merchants shouted, “Noble Saṅgharakṣita! What are you doing? What are you doing?”

source: དེ་དེ་དག་དེ་ལྟར་བཟློག་བཞིན་དུ་རྒྱ་མཚོ་ཆེན་པོར་མཆོངས་པ་དང་།
en: As they tried to stop him, Saṅgharakṣita jumped into the sea

source: དེ་མ་ཐག་ཁོ་ནར་ཀླུ་རྣམས་ཀྱིས་གྲུ་བོ་ཆེ་དེ་བཏང་ངོ་། །
en: and at the very moment he did so, the nāgas released the ship.

source: ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་ཡང་ཀླུ་རྣམས་ཀྱིས་ཁྲིད་དེ་ཀླུའི་གནས་སུ་ཞུགས་སོ།
en: Taking the venerable Saṅgharakṣita, the nāgas returned to the land of the nāgas.

source: དེ་ནས་ཀླུ་དེ་རྣམས་ཀླུའི་བུ་མོ་རྣམས་དང་ལྷན་ཅིག་འཛུམ་པ་སྔོན་དུ་བཏང་སྟེ
en: Smiling at one another, the nāgas and their nāga women

source: ་ཡ་མཚན་སྐྱེས་ནས་མིག་ཚུགས་སུ་ལྟ་ཞིང་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་མཆོད་རྟེན་དེ་དག་ལ་ཕྱག་འཚལ་དུ་གཞུག་པར་བརྩམས་ཏེ་སྨྲས་པ།
en: watched in amazement as they invited the venerable Saṅgharakṣita to pay homage to a set of shrines, saying,

source: འཕགས་པ་དགེ་འདུན་འཚོ་འདི་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཀྱི་དྲི་གཙང་ཁང་ལགས་སོ། །འདི་ནི་གཙུག་ཏོར་ཅན་དང་། ཐམས་ཅད་སྐྱོབ་དང་། འཁོར་བ་འཇིག་དང་། གསེར་ཐུབ་དང་། འོད་སྲུང་གི་དྲི་གཙང་ཁང་ལགས་སོ། །
en: “Noble Saṅgharakṣita, this shall be the sanctuary of the perfectly awakened Buddha Vipaśyin, while these shall be the sanctuaries of the perfectly awakened Buddhas Śikhin, Viśvabhū, Krakucchanda, Kanakamuni, and Kāśyapa.

source: འདི་ནི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་དྲི་གཙང་ཁང་ལགས་སོ། །
en: This shall be the sanctuary of the Blessed One Śākyamuni.”

source: དེས་དེ་དག་དང་ལྷན་ཅིག་མཆོད་རྟེན་དག་ལ་ཕྱག་འཚལ་ནས་ཀླུའི་ཚོགས་ཀྱི་གུང་ལ་སྟན་བཤམས་པ་ཉིད་ལ་འདུག་གོ། །
en: After prostrating to the shrines with them, Saṅgharakṣita sat on the seat they had arranged at the center of the assembled nāgas.

source: དེ་ནས་ཀླུ་དེ་རྣམས་ཀྱིས་ཐལ་མོ་སྦྱར་ནས་གསོལ་བ་བཏབ་པ།
en: The nāgas joined their palms and supplicated him:

source: འཕགས་པ་དགེ་འདུན་འཚོ་ལྷ་དང་མི་རྣམས་ལ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་མདོ་སྡེ་དང་།
en: “Noble Saṅgharakṣita, though the Blessed One’s sūtras

source: མ་མོ་རབ་ཏུ་གནས་ན། བདག་ཅག་ཀླུ་རྣམས་ནི་མི་ཁོམ་པར་སྐྱེས། ལོག་པར་ལྟུང་བའི་ལུས་དང་ལྡན་པས།
en: and mātṛkā have taken root among gods and humans, we nāgas were born into this cursed state with fallen forms!

source: ཀྱེ་མ་འཕགས་པས་བདག་ཅག་ལ་མདོ་སྡེའི་མཐའ་རབ་ཏུ་གནས་པར་མཛད་དུ་གསོལ།
en: O noble one, please see that the ultimate sūtras take root among us!”

source: དེས་དེ་ལྟར་བྱའོ་ཞེས་ཁས་བླངས་སོ། །
en: Saṅgharakṣita assented with the words, “I shall do just that.”

source: དེ་ནས་སྤྲུལ་པ་དེས་ཀླུ་གཞོན་ནུ་གསུམ་སྤྲོ་བ་བསྐྱེད་ནས་གཅིག་ལ་སྨྲས་པ།
en: The shape shifter who had fled his seaside monastery for the land of the nāgas after being confronted by the group of six then chose three nāga youths and said to the first,

source: རེ་ཞིག་ཁྱོད་ཀྱིས་ནི་ཡང་དག་པར་ལྡན་པ་ལྷོགས་ཤིག །
en: “You shall memorize the Saṃyuktāgama

source: གཉིས་པ་ལ་སྨྲས་པ། ཁྱོད་ཀྱིས་ནི་བར་མ་ལྷོགས་ཤིག །
en: To the second he said, “You shall memorize the Madhyamāgama

source: གསུམ་པ་ལ་སྨྲས་པ། ཁྱོད་ཀྱིས་ནི་རིང་པོ་ལྷོགས་ཤིག །
en: To the third he said, “You shall memorize the Dīrghāgama

source: ཁོ་བོས་ཀྱང་གཅིག་ལས་འཕྲོས་པའི་ལུང་བརྗོད་པའི་སྐབས་དེ་དག་ཉིད་ལ་གསལ་བར་བྱའོ། །
en: The nāgas can learn how to recite the Ekottarikāgama by listening to me recite it.”

source: དེ་དག་གིས་བཀླག་པར་བརྩམས་ནས་དེ་ན་
en: When the young nāgas began to recite,

source: གཅིག་ནི་མིག་བཙུམས་ཏེ་ལུང་ནོད་པར་བྱེད་དོ། །
en: the first closed his eyes as he sought to memorize the Saṃyuktāgama

source: གཉིས་པ་ནི་རྒྱབ་ཀྱིས་ཕྱོགས་ཏེ་ལུང་ནོད་པར་བྱེད་དོ། །
en: the second turned his back as he sought to memorize the Madhyamāgama

source: གསུམ་པ་ནི་ཐག་རིང་པོར་འདུག་སྟེ་ལུང་ནོད་པར་བྱེད་དོ། །
en: while the third sat off in the distance as he sought to memorize the Dīrghāgama

source: དེ་དག་གི་ནང་ནས་སྤྲུལ་པ་དེ་ཉིད་ནི་སྔོན་གྱི་བག་ཆགས་ཀྱི་ཁྱད་པར་གྱིས་གུས་པ་དང་བཅས་པ་དང་། ཞེ་ས་དང་བཅས་པ་དང་།
en: Because the shape shifter had greater exposure to Buddhist customs than the others, he was respectful, deferential,

source: འཕྲལ་གྱི་བྱ་བ་ཐམས་ཅད་ལ་ཐོག་མར་འགྲོ་བ་ཡིན་པས་དེ་ནང་བར་སྔར་ལངས་ཏེ།
en: and came first to all of their chores. He would rise early and say,

source: འཕགས་པ་བཞེངས་ལ་ཚེམས་ཤིང་འོར་ཅིག །
en: “Noble ones, get up and brush your teeth.

source: བཅོམ་ལྡན་འདས་ཀྱི་དཀྱིལ་འཁོར་དང་མཆོད་རྟེན་ལ་ཕྱག་མཛོད་ཅིག །
en: Pay homage to the gathering of blessed ones and their shrines.

source: བཤོས་གསོལ་ཅིག །གཟིམས་མལ་ཤོམས་ཤིག་ཅེས་སྨྲ་བར་བྱེད་དོ། །ཇི་ཙམ་ན་དེ་ཐམས་ཅད་ཀྱིས་རིམ་གྱིས་ལུང་རྣམས་བཀླགས་པ་དང་། །
en: Eat and make the bed.” Once, as they were all reciting their respective Āgamas, the shape shifter said,

source: སྤྲུལ་པ་དེས་སྨྲས་པ། འཕགས་པ་འདི་དག་གིས་ལུང་རྣམས་བཀླགས་ན་ཅི་འཛིན་ཏམ་འོན་ཏེ་མི་འཛིན། །
en: “Noble one, if nāga youths recite the Āgamas, will they remember them or not?”

source: དེས་སྨྲས་པ། འདི་དག་དྲན་པ་དང་ལྡན་པས་འཛིན་པར་ནི་འགྱུར་ན་འདི་ལྟར་འདི་དག་ལ་ཉེས་པ་ཡོད་དོ།
en: Saṅgharakṣita replied, “Even if with their good memories they remember them, they still have certain faults.”

source: དེས་སྨྲས་པ། འཕགས་པ་ནོངས་པ་ཅི་མཆིས།
en: “Noble one,” the shape shifter asked, “what are their failings?”

source: འདི་དག་ཐམས་ཅད་གུས་པ་མེད་པ་དང་ཞེ་ས་མེད་པ་ཡིན་ཏེ། རེ་ཞིག་གཅིག་ནི་མིག་བཙུམས་ཏེ་ལུང་ནོད་པར་བྱེད།
en: “They lack respect and deference. The first closes his eyes as he seeks to memorize the Saṃyuktāgama

source: གཉིས་པ་ནི་རྒྱབ་ཀྱིས་ཕྱོགས་ཏེ་ལུང་ནོད་པར་བྱེད།
en: the second turns his back as he seeks to memorize the Madhyamāgama

source: ཁྱོད་འབའ་ཞིག་གུས་པ་དང་བཅས་པ་དང་། ཞེ་ས་དང་བཅས་པ་དང་འཕྲལ་གྱི་བྱ་བ་ཐམས་ཅད་ལ་ཐོག་མར་འགྲོ་བ་ཡིན་ནོ། །
en: You alone are respectful, deferential, and come first to all of your chores.”

source: དེས་སྨྲས་པ། འཕགས་པ་དེ་དག་ནི་གུས་པ་མ་མཆིས་པ་དང་། ཞེས་མ་མཆིས་པ་མ་ལགས་ཏེ།
en: “Noble one,” the shape shifter replied, “it is not that they lack respect and deference.

source: རེ་ཞིག་མིག་བཙུམས་ཏེ་ལུང་ནོད་པ་གང་ལགས་པ་ནི་མིག་གདུག་པ་ལགས་སོ། །
en: The one who closes his eyes as he seeks to memorize the Saṃyuktāgama has noxious eyes that burn;

source: རྒྱབ་ཀྱིས་ཕྱོགས་ཏེ་ལུང་ནོད་པ་གང་ལགས་པ་ནི་དབུགས་གདུག་པ་ལགས་སོ། །
en: the one who turns his back as he seeks to memorize the Madhyamāgama has noxious breath;

source: ཐག་རིང་པོར་མཆིས་ཏེ་ལུང་ནོད་པ་གང་ལགས་པ་དེ་ནི་རེག་པ་གདུག་པ་ལགས་སོ།
en: and the one who sits off in the distanceas he seeks to memorize the Dīrghāgama has a noxious touch.

source: བདག་གཅིག་པུ་ནི་མཆེ་བ་གདུག་པ་ལགས་སོ། །
en: I myself have noxious fangs.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་སྐྲག་ནས་བསམས་པ།
en: Frightened, the venerable Saṅgharakṣita thought,

source: བདག་ཁོ་བོ་དགྲ་བོ་རྣམས་ཀྱི་ནང་ན་འདུག་པ་ལྟ་སྙམ་ནས།
en: “Look! I am living among my mortal enemies,”

source: དེ་སྐྱ་བོ་བསེང་བསེང་པོ། རིད་པ་དང་། ཉམ་ཆུང་བ་དང་། རྐེ་བ་དང་སྐམ་པ་དང་ལུས་མ་ཐོབ་པར་གྱུར་ཏོ། །
en: and he grew pallid, emaciated, feeble, withered, thin, and weak.

source: ཀླུ་སྤྲུལ་པས་སྨྲས་པ། འཕགས་པ་ཁྱོད་ཅིའི་སླད་དུ་སྐྱ་བོ་བསེང་བསེང་པོ། །རིད་པ་དང་། ཉམ་ཆུང་བ་དང་། རྐེ་བ་དང་། སྐམ་པ་དང་། ལུས་མ་ཐོབ་པར་གྱུར།
en: The shape-shifting nāga asked, “Noble one, why have you become pallid, emaciated, feeble, withered, thin, and weak?”

source: དེས་སྨྲས་པ། ཁོ་བོ་ནི་དགྲ་བོ་རྣམས་ཀྱི་ནང་ན་འདུག་སྟེ་གང་གི་ཚེ་ཁྱེད་ཅག་ལས་གང་ཡང་རུང་བ་ཞིག་འཁྲུགས་པར་གྱུར་པ་དེའི་ཚེ་ན་ཁོ་བོ་མིང་ཙམ་ཞིག་ལུས་པར་འགྱུར་རོ། །
en: “I am among enemies so the moment I do anything to upset you, I shall be reduced to naught but a memory.”

source: དེས་སྨྲས་པ། བདག་ཅག་འཕགས་པ་ལ་གནོད་པ་མི་བགྱིད་དེ།
en: “We do not intend to harm the noble one.

source: འདི་ལྟར་འཕགས་པ་སླར་འཛམ་བུའི་གླིང་དུ་གཤེགས་བཞེད་དམ་ཅི།
en: However, given the situation, does the noble one wish to return to Jambudvīpa?”

source: དེས་སྨྲས་པ། བཞིན་བཟངས་ཁོ་བོ་འདི་ན་དགའ་བ་མེད་པས་འགྲོ་འདོད་དོ། །
en: “My dear sir , I do. I do not care for this place.”

source: དེ་ནས་ཀླུ་དེ་རྣམས་ཀྱིས་ཕན་ཚུན་གྲོས་བྱས་ཏེ།
en: The nāgas discussed the matter amongst themselves

source: གང་གི་ཚེ་གྲུ་བོ་ཆེ་དེ་ཕྱོགས་དེར་འོངས་པ་དེའི་ཚེ་ན་འཕགས་པ་དགེ་འདུན་འཚོ་བཏེག་སྟེ་གྲུ་བོ་ཆེའི་ནང་དུ་བཞག་གོ། །
en: and when the noble Saṅgharakṣita’s ship passed by on its return journey, they raised him from the waters and placed him onboard the ship.

source: དེ་ནས་ཚོང་པ་དེ་དག་འཛུམ་པ་སྔོན་དུ་བཏང་སྟེ་ཡ་མཚན་སྐྱེས་ནས་མིག་ཚུགས་སུ་ལྟ་ཞིང་སྨྲས་པ།
en: Smiles broke out upon the merchants’ faces as they stared in amazement and cried out,

source: འཕགས་པ་དགེ་འདུན་འཚོ་བྱོན་པ་ལེགས་སོ། །
en: “Welcome back, noble Saṅgharakṣita, welcome back!”

source: བྱོན་པ་ལེགས་སོ་དེས་སྨྲས་པ། ཤེས་ལྡན་དག་
en: Saṅgharakṣita said, “Gentlemen

source: ཁོ་བོས་ནི་ཀླུའི་གནས་སུ་ཀླུ་རྣམས་ལ་ལུང་བཞི་པོ་དག་རབ་ཏུ་གནས་པར་བྱས་ཀྱིས་རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །
en: Rejoice, for I have seen to it that the Four Āgamas have taken root in the land of nāgas!”

source: དེ་དག་གིས་སྨྲས་པ། འཕགས་པ་འདི་ལྟ་སྟེ། གཞན་ལ་ཕན་འདོགས་པ་འདི་ནི་སྟོན་པའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བས་བགྱི་བ་ལགས་ཏེ་རྗེས་སུ་ཡི་རང་ངོ་། །
en: “Noble one, we do! We rejoice in this good you have done for others, for this is the job of those who go forth.”

source: དེ་ནས་ཚོང་པ་དེ་དག་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་དང་ལྷན་ཅིག་ཚོགས་ཤིང་ཀུན་དགའ་བཞིན་དུ་མཐར་གྱིས་རྒྱ་མཚོའི་འགྲམ་དུ་ཕྱིན་ཏོ། །
en: Reunited and happy, the merchants and the venerable Saṅgharakṣita completed the journey back to shore.

source: ཇི་ཙམ་ན་ཐམས་ཅད་ངལ་ཞིང་དུབ་པས་གཉིད་ལོག་པ་ན་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་ཡང་རྒྱ་མཚོ་ཆེན་པོ་ལ་བལྟ་བར་བརྩམས་སོ།
en: On arriving, all were tired and weary. As his companions slept, the venerable Saṅgharakṣita turned his gaze to the ocean.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དག་ལྔ་པོ་འདི་དག་ནི་བལྟ་བས་ཆོག་མི་ཤེས་ཤིང་མཐོང་ན་མི་མཐུན་པ་མེད་པ་ཡིན་ཏེ།
en: The Blessed One has said, “Monks, there are five things one never tires of looking at and which are in no way displeasing to the eye.

source: མཐོང་ན་མི་མཐུན་པ་མེད་པ་ཡིན་ཏེ།
en: and which are in no way displeasing to the eye.

source: ནི་བལྟ་བས་ཆོག་མི་ཤེས་ཤིང་
en: One never tires of looking at

source: དགེ་སློང་དག་གླང་པོ་ཆེ་ཅང་ཤེས་གཞོན་ཤ་ཅན་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། རྒྱ་མཚོ་དུག་ཅན་པ་དང་། རིའི་རྒྱལ་རྒྱལ་པོ་རི་རབ་དང་།
en: a clever and youthful elephant; a king of the world; the ocean with its monsters;

source: ་མཐོང་ན་མི་མཐུན་པ་མེད་པ་ཡིན་ནོ་ཞེས་གསུངས་པས།
en: —these five things are in no way displeasing to the eye.”

source: དེ་ཡུན་རིང་དུ་རྒྱ་མཚོ་ཆེན་པོ་ལ་ལྟ་བ་ན་དུབ་པས་ཐོ་རངས་གཉིད་སྟུག་པོས་ནོན་ཏོ། །
en: Saṅgharakṣita gazed long at the ocean until just before dawn when, fatigued, he was overcome by a deep sleep.

source: དེ་ནས་ཚོང་པ་དེ་དག་ཁལ་དག་བཀལ་ཏེ་འཕགས་ནས་
en: Not long after, the merchants loaded the pack animals and set out.

source: མཚན་མོ་ནམ་ནངས་པ་ན་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་མི་སྣང་ནས།
en: But because it was in the wee hours of the morning, they could not see the venerable Saṅgharakṣita

source: དེ་དག་བརྟད་ཅིང་ཤེས་ལྡན་དག་འཕགས་པ་དགེ་འདུན་འཚོ་ག་རེ་ཞེས་ཕན་ཚུན་དུ་བལྟ་བར་བརྩམས་པ་དང་།
en: and they began to look and ask one another, “Gentlemen , what has happened to the noble Saṅgharakṣita?”

source: དེ་ན་ཁ་ཅིག་ན་རེ་མདུན་དུ་སོང་ངོ་ཞེས་ཟེར་རོ། །ཁ་ཅིག་ན་རེ་ཕྱི་བཞིན་འོང་ངོ་ཞེས་ཟེར་རོ། །ཁ་ཅིག་ན་རེ་དབུས་ནས་འགྲོའོ་ཞེས་ཟེར་རོ།
en: Some suggested he had gone ahead while others said he was still coming from behind and still others said he was traveling in the middle of the caravan.

source: དེ་དག་རྣམ་པ་ཐམས་ཅད་དུ་ཀུན་དུ་ཚོལ་བ་ན་ཡི་ཆད་པར་གྱུར་ཅིང་མ་མཐོང་ངོ་། །དེ་ནས་དེ་དག་བཞིན་ཉམས་ཤིང་དམན་པར་གྱུར་ཏེ་སྨྲས་པ། །
en: After searching everywhere to no avail, they gave up. Dispirited and downcast, they said,

source: ཤེས་ལྡན་དག་བདག་ཅག་གིས་འཕགས་པ་དགེ་འདུན་འཚོ་བོར་བ་མ་ལེགས་པ་བྱས་ཀྱིས་ཕྱིར་ལྡོག་པར་བྱའོ། །
en: “Gentlemen , it is not good that we have left the noble Saṅgharakṣita behind. We must turn around.”

source: ཡང་བསམས་པ། འཕགས་པ་དགེ་འདུན་འཚོ་ནི་རྫུ་འཕྲུལ་ཆེ་བ་མཐུ་ཆེ་བ་ཡིན་པས་འདི་ལྟར་རྒྱ་མཚོ་ཆེན་པོར་
en: But then, on reflection, it occurred to them, “The noble Saṅgharakṣita possesses miraculous powers and great might.

source: ཡང་དུས་ལ་མ་བབ་ན་དེ་ད་ལྟ་སྐམ་ལ་ཕྱིན་ན་དུས་ལ་བབ་པར་ག་ལ་འགྱུར།
en: If he did not meet his end in the ocean, how could he meet his end while traveling on dry land?

source: དེ་ནི་རྫུ་འཕྲུལ་ཆེ་བ་མཐུ་ཆེ་བ་ཡིན་པས་དེ་ཆེས་སྔོན་དུ་སོང་བ་གང་ཡིན་པ་དེ་ལྟ་བུའི་གནས་ཡོད་དོ་སྙམ་ནས་
en: With his miraculous powers and great might, he must have gone far ahead of us and be waiting there now.”

source: སྨྲས་པ། ཤེས་ལྡན་དག་ཚུར་ཤེག་འདོང་ཞེས་དེ་དག་འཕགས་སོ། །
en: With the call, “Gentlemen, come, let us go!” they set out.

source: ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་ཡང་བྱེ་མའི་ཐང་སྟོང་པ་ལ་
en: Saṅgharakṣita sees the effects of actions with his own eyes

source: ཉི་མ་འཆར་བའི་དུས་ཀྱི་ཚེ་ཉི་མའི་འོད་ཟེར་དག་གིས་ཕོག་ནས་སད་པ་དང་། ཇི་ཙམ་ན་ཅི་ཡང་
en: When the sun rose, its rays struck the venerable Saṅgharakṣita as he lay asleep on the empty, sandy beach, waking him from his slumber.

source: མི་སྣང་ནས་དེས་བསམས་པ། ཚོང་པ་དེ་དག་ནི་དོང་ན་ད་ཇི་ལྟར་བྱ།
en: Seeing no one around, he thought, “What will I do if the merchants have left?

source: གར་བབ་བབ་ཏུ་འགྲོའོ་སྙམ་མོ། །
en: They might have gone in any direction!”

source: ཚེ་དང་ལྡན་པ་དེ་སྙིང་སྟོབས་ཆེ་བས་སོང་བ་དང་ལམ་མི་སྣང་ནས་
en: With great courage, the venerable Saṅgharakṣita set out but he could see no trail.

source: དེས་ཕན་ཚུན་བཙལ་ནས་ལམ་སྲང་ཞིག་མཐོང་ནས་དེ་དེར་ཞུགས་པ་དང་།
en: After searching about, he spied a narrow path and set off upon it.

source: ཇི་ཙམ་ན་ས་ལའི་དགོན་པ་ཞིག་ན་གཙུག་ལག་ཁང་རྟ་བབས་མཐོན་པོ་དང་ལྡན་པ།
en: After a time, he saw, in a forest of śāla trees, a monastery with a high gate, skylights, and latticed windows.

source: མཐོངས་ཁུང་དང་། སྐར་ཁུང་དྲ་བ་ཅན་དང་། ལན་ཀན་གྱིས་བརྒྱན་པ། སྙིང་དང་མིག་འཕྲོག་པར་བྱེད་པ།
en: It was adorned with balustrades, beguiling to the heart and beautiful to the eye,

source: མཐོ་རིས་ཀྱི་ཐེམ་སྐས་སུ་གྱུར་པ། ཁྲི་དང་ཁྲིའུ་དང་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ།
en: with a staircase to the upper level and perfectly outfitted with beds, seats, and supplies.

source: ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་བསྐོར་བ། རྫིང་བུ་དང་མཚེའུས་ཉེ་བར་མཛེས་པར་བྱས་པ།
en: It was surrounded by a variety of trees, and graced with pools and ponds,

source: ངང་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་དང་། ནེ་ཚོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་མངོན་པར་སྒྲ་འབྱིན་པ། ལྷའི་གནས་ལྟར་དཔལ་གྱིས་འབར་བ་ཞིག་དང་། །
en: ringing with the sounds of swans, cranes, peacocks, parrots, mynahs, and cuckoos.

source: དེ་ན་དགེ་སློང་ལེགས་པར་བགོས་ཤིང་ལེགས་པར་སྦྱངས་པ།
en: When he saw the resident monks, finely dressed and well trained,

source: སྤྱོད་ལམ་ཞི་བས་གནས་པ་དག་མཐོང་ནས་གུས་པ་དང་བཅས་པས་དེ་དག་གི་གན་དུ་སོང་ངོ་།
en: living peacefully in this glorious and heavenly abode, he respectfully approached them.

source: དེ་ནས་དེ་དག་གུས་པར་སྒྲིམ་པ་དང་བཅས་པས་དེ་ལ་སྨྲས་པ།
en: With a show of respect, they said to him,

source: བཙུན་པ་དགེ་འདུན་འཚོ་བྱོན་པ་ལེགས་སོ་བྱོན་པ་ལེགས་སོ་ཁྱོད་ད་གཟོད་ག་ལས་བྱོན།
en: “Welcome, reverend Saṅgharakṣita, welcome. From where have you come just now?”

source: དེས་ཇི་ལྟར་གྱུར་པ་ཐམས་ཅད་བརྗོད་པ་དང་། དེ་ནས་དེ་དག་གིས་ངལ་སོར་བཅུག་སྟེ།
en: After he explained everything that had happened,

source: ལམ་གྱི་དུབ་པ་བསལ་ནས་གཙུག་ལག་ཁང་དུ་ཁྲིད་དོ། །
en: they let him rest and once he recovered from the fatigue of the road, they led him into the monastery.

source: ཇི་ཙམ་ན་སྟན་བཟང་པོ་བཤམས་པ་དང་། ཁ་ཟས་བསོད་པའི་སྤྱི་བུངས་བཤམས་པ་མཐོང་ནས་དེ་དག་གིས་དེ་ལ་སྨྲས་པ།
en: Once there, he saw that fine seats had been arranged and choice foods laid out. They asked him,

source: བཙུན་པ་དགེ་འདུན་འཚོ་མི་སྐྱེམས་སམ། མི་སྦྲེབས་སམ། །
en: “Reverend Saṅgharakṣita, are you not thirsty? Are you not hungry?”

source: དེས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་དག་སྐོམ་མོ། །བཀྲེས་སོ། །
en: “Venerables,” he replied, “I am thirsty and I am hungry.”

source: དེ་དག་གིས་སྨྲས་པ། བཙུན་པ་དགེ་འདུན་འཚོ་གསོལ་ཅིག །
en: “Then partake, reverend Saṅgharakṣita.”

source: དེས་སྨྲས་པ། དགེ་འདུན་གྱི་ནང་དུ་བཟའོ། །
en: “I will eat with the saṅgha.”

source: དེ་དག་གིས་སྨྲས་པ། བཙུན་པ་དགེ་འདུན་འཚོ་ཁྱོད་ཤུལ་གྱིས་དུབ་པ་ལགས་ཀྱིས་ད་གསོལ་ཅིག །
en: “Reverend Saṅgharakṣita, you are tired from your travels, so eat now.

source: སླད་ཀྱིས་འདིར་ཉེས་དམིགས་འབྱུང་བར་འགྱུར་རོ། །
en: Later the food will have spoiled.”

source: དེས་ཉེས་དམིགས་མཐོང་བས་ཟོས་ནས་མཐའ་གཅིག་ཏུ་སོང་སྟེ་འདུག་གོ། །
en: Seeing the fault in waiting, Saṅgharakṣita ate and then took a seat off to one side.

source: ཇི་ཙམ་ན་དེ་དག་དྲོ་ལ་བབ་སྟེ།
en: Some time later, the meal was laid out and

source: གཎྜཱི་བརྡུངས་པ་ན་རང་རང་གི་ལྷུང་བཟེད་ཐོགས་ཏེ་
en: when the wooden beam was struck, the monks filed in, each carrying his own begging bowl,

source: གྲལ་རིམས་བཞིན་འཁོད་དོ།
en: and sat down in order of seniority.

source: དེ་དག་འཁོད་པ་དང་གཙུག་ལག་ཁང་དེ་ཡང་མི་སྣང་བར་གྱུར་ཅིང་དེ་དག་གི་རང་རང་གི་ལྷུང་བཟེད་ཀྱང་ལྕགས་ཀྱི་ཐོ་བ་རྣམ་པ་སྣ་ཚོགས་སུ་གྱུར་ཏོ།
en: As soon as they sat down, the monastery vanished and each of their begging bowls turned into iron clubs of different sorts.

source: དེ་ནས་དེ་དག་ཇི་སྲིད་དུ་དྲོ་མ་ཡོལ་གྱི་བར་དུ་ལྕགས་ཀྱི་ཐོ་བ་དེ་དག་གིས་ཕན་ཚུན་གླད་པ་བཅོམ་ནས་
en: For the remainder of the meal, they bludgeoned each other over the head with their iron clubs,

source: དེ་དག་གླད་པ་ཞོམ་ཞིང་སྡུག་བསྔལ་གྱི་ཚོར་བས་ཉེན་ནས་ཉམ་ཐག་པའི་སྐད་འབྱིན་ཏོ། །
en: cracking their skulls open and inflicting unbearable pain that caused them to cry out pitifully.

source: ཇི་ཙམ་ན་དྲོ་ཡོལ་བ་དང་གཙུག་ལག་ཁང་དེ་ཡང་དེ་ཁོ་ན་བཞིན་དུ་ཕྱིར་བྱུང་ཞིང་དགེ་སློང་དེ་དག་ཀྱང་དེ་ཁོ་ན་བཞིན་དུ་སྤྱོད་ལམ་ཞི་བས་གནས་སོ། །
en: As soon as the mealtime ended, the monastery reappeared as before while the monks also resumed their peaceful demeanors.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་དགེ་འདུན་འཚོ་དེ་དག་གི་གན་དུ་སོང་སྟེ་དྲིས་པ།
en: The venerable Saṅgharakṣita approached them and asked,

source: ཚེ་དང་ལྡན་པ་དག་ཁྱེད་སུ་ཡིན། ལས་གང་གིས་འདིར་སྐྱེས།
en: “Who are you, venerables? What karma has led you to this?”

source: དེ་དག་གིས་སྨྲས་པ། བཙུན་པ་དགེ་འདུན་འཚོ་འཛམ་བུའི་གླིང་པའི་མི་རྣམས་ནི་ཡིད་ཆེས་པར་དཀའ་བས་ཁྱེད་ཡིད་ཆེས་པར་མི་འགྱུར་རོ། །
en: “Reverend Saṅgharakṣita,” they replied, “the people of Jambudvīpa are skeptical, so you will not believe us.”

source: དེས་སྨྲས་པ། ཁོ་བོས་མངོན་སུམ་ཁོ་ནར་མཐོང་ན་ཅིའི་ཕྱིར་ཡིད་ཆེས་པར་མི་འགྱུར།
en: “Why would I not believe what I have seen with my own eyes?”

source: དེ་དག་གིས་སྨྲས་པ། བཙུན་པ་དགེ་འདུན་འཚོ་བདག་ཅག་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཉན་ཐོས་སུ་གྱུར་ཏེ།
en: “Reverend Saṅgharakṣita, we were disciples of the perfectly awakened Buddha Kāśyapa.

source: ཇི་ཙམ་ན་བདག་ཅག་གིས་ཟན་གྱི་གྲལ་དུ་འཐབ་མོ་བགྱིས་པས་ལས་དེའི་རྣམ་པར་སྨིན་པས་བདག་ཅག་ཉི་ཚེ་བའི་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་ཏེ།
en: While in the meal queue, we fought and, as the fruition of that karma, have been born as denizens of an ephemeral hell.

source: བདག་ཅག་འདི་ནས་ཤི་འཕོས་པ་དག་སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་བ་གང་ལགས་པ་དེ་ལྟ་བུའི་གནས་ཀྱང་མཆིས་པར་འགྱུར་རོ། །
en: As soon as we die and pass from this life, we will be reborn among the denizens of hell and will have to live there in such straits.

source: བཙུན་པ་དགེ་འདུན་འཚོ་དེའི་སླད་དུ་འཛམ་བུའི་གླིང་དུ་གཤེགས་ནས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་ལ་ཚེ་དང་ལྡན་པ་དག་འདི་ལྟ་སྟེ། །
en: Reverend Saṅgharakṣita, once you have returned to Jambudvīpa, say to the brethren,

source: དཔེར་ན་འོད་སྲུང་གི་དགེ་སློང་དག་ལྟར་ཟན་གྱི་གྲལ་དུ་ཐབ་མོ་མ་བྱེད་ཅིག །
en: ‘Venerables, do not fight in the food queue like Kāśyapa’s monks.

source: སྡུག་བསྔལ་གྱི་ཚོགས་དེ་ལྟ་བུའི་སྐལ་བ་ཅན་དུ་འགྱུར་བར་མ་བྱེད་ཅིག་
en: Do not act so as to accrue the fortune for that mass of suffering.’

source: ཅེས་དོན་འདི་རྒྱ་ཆེར་བརྗོད་ན་ལེགས་སོ། །
en: It would be good if you were you to explain our plight at length.”

source: དེས་དེ་ལྟར་བྱའོ་ཞེས་ཁས་བླངས་ཏེ་སོང་ངོ་། །
en: After agreeing to do just that, Saṅgharakṣita departed.

source: ཇི་ཙམ་ན་དེ་ཁོ་ན་བཞིན་དུ་ས་ལའི་དགོན་པ་ཞིག་ན་གཙུག་ལག་ཁང་གཉིས་པ་རྟ་བབས་མཐོན་པོ་དང་ལྡན་པ།
en: After some time, he saw again as before, in a forest of śāla trees, a second monastery with a high gate, skylights, and latticed windows.

source: མཐོ་རིས་ཀྱི་ཐེམ་སྐས་སུ་གྱུར་པ། ཁྲི་དང་ཁྲིའུ་དང་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ། །
en: with a staircase to the upper level, and perfectly outfitted with beds, seats, and supplies.

source: ཁྲི་དང་ཁྲིའུ་དང་ཡོ་བྱད་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ།
en: and perfectly outfitted with beds, seats, and supplies.

source: ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་བསྐོར་བ།
en: It was surrounded by a variety of trees,

source: རྫིང་བུ་དང་མཚེའུས་ཉེ་བར་མཛེས་པར་བྱས་པ། ངང་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དག་མངོན་པར་སྒྲ་འབྱིན་པ། །
en: and graced with pools and ponds, ringing with the sounds of swans, cranes, peacocks, parrots, mynahs, and cuckoos.

source: ལྷའི་གནས་ལྟར་དཔལ་གྱིས་འབར་བ་ཞིག་དང་། དེ་ན་དགེ་སློང་ལེགས་པར་བགོས་ཤིང་ལེགས་པར་སྦྱངས་པ། སྤྱོད་ལམ་ཞི་བས་གནས་པ་དག་མཐོང་ནས་
en: When he saw the resident monks, finely dressed and well trained, living peacefully in this glorious and heavenly abode,

source: གུས་པ་དང་བཅས་པས་དེ་དག་གི་གན་དུ་སོང་ངོ་།
en: he respectfully approached them.

source: དེ་ནས་དེ་དག་གིས་གུས་པ་དང་སྒྲིམ་པ་དང་བཅས་པས་དེ་ལ་སྨྲས་པ། བཙུན་པ་དགེ་འདུན་འཚོ་བྱོན་པ་ལེགས་སོ་བྱོན་པ་ལེགས་སོ།
en: With a show of respect, they said to him, “Welcome, reverend Saṅgharakṣita, welcome.

source: ཁྱོད་ད་གཟོད་ག་ལས་བྱོན།
en: From where have you come just now?”

source: དེས་ཇི་ལྟར་གྱུར་པ་ཐམས་ཅད་བརྗོད་པ་དང་། དེ་ནས་དེ་དག་གིས་ངལ་སོར་བཅུག་སྟེ། ལམ་གྱིས་དུབ་པ་བསལ་ནས་
en: After he explained everything that had happened, they let him rest and once he recovered from the fatigue of the road,

source: གཙུག་ལག་ཁང་དུ་ཁྲིད་དོ། །
en: they led him into the monastery.

source: ཇི་ཙམ་ན་སྟན་བཟང་པོ་བཤམས་པ་དང་། ཁ་ཟས་བསོད་པའི་སྤྱི་བུངས་བཤམས་པ་དག་མཐོང་ནས་
en: Once there, he saw that fine seats had been arranged and choice foods laid out.

source: དེ་དག་གིས་དེ་ལ་སྨྲས་པ། བཙུན་པ་དགེ་འདུན་འཚོ་མི་སྐྱེམས་སམ། མི་སྦྲེབས་སམ།
en: They asked him, “Reverend Saṅgharakṣita, are you not thirsty? Are you not hungry?”

source: དེ་དག་གིས་སྨྲས་པ། བཙུན་པ་དགེ་འདུན་འཚོ་ཁྱོད་ཤུལ་གྱིས་མཉེལ་བ་ལགས་ཀྱིས་ད་གསོལ་ཅིག །
en: “Reverend Saṅgharakṣita, you are fatigued from your travels, so eat now.

source: ཇི་ཙམ་ན་དེ་དག་དྲོ་ལ་བབ་སྟེ་གཎྜཱི་བརྡུངས་པ་ན་རང་རང་གི་ལྷུང་བཟེད་ཐོགས་ཏེ་
en: Some time later, the meal was laid out and when the wooden beam was struck, the monks filed in, each carrying his own begging bowl,

source: གྲལ་རིམས་བཞིན་དུ་འཁོད་དོ། །
en: and sat down in order of seniority.

source: དེ་དག་འཁོད་པ་དང་གཙུག་ལག་ཁང་དེ་ཡང་མི་སྣང་བར་གྱུར་ཅིང་བཟའ་བ་དང་བཏུང་བ་དེ་དག་ཀྱང་ལྕགས་ཁུ་དག་ཏུ་གྱུར་ཏོ། །
en: As soon as they sat down, the monastery vanished and the food and drink turned into molten iron.

source: དེ་ནས་དེ་དག་ཇི་སྲིད་དྲོ་མ་ཡོལ་གྱི་བར་དུ་ལྕགས་ཁུ་དེ་དག་གིས་ཕན་ཚུན་གཏོར་ནས་
en: For the remainder of the meal, they doused one another in molten iron,
